code_computing/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          127;
        startFace       24784;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          127;
        startFace       24911;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25192;
        startFace       25038;
    }
    defaultFaces
    {
        type            wall;
        inGroups        List<word> 1(empty);
        nFaces          562;
        startFace       50230;
    }
)

// ************************************************************************* //
